

# VLAN作成
Router# configure terminal
Router(config)# vlan 10
Router(config-vlan)# name VLAN10
Router(config-vlan)# exit

# VLANをインターフェースに割り当てる
Router(config)# interface FastEthernet 0/2
Router(config-if)# switchport mode access
Router(config-if)# switchport access vlan 10
Router(config-if)# exit

# ルーティングを有効化
Router(config)# ip routing

# VTY接続の設定
Router(config)# line vty 0 4
Router(config-line)# login local
Router(config-line)# exit

# ホスト名とドメイン名の設定
Router(config)# hostname R1
R1(config)# ip domain-name example.com
R1(config)# exit
